Revit 2024 API
IDropHandler.Execute Method
 Implement this method to handle the drop event for your data.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
void Execute(
	UIDocument document,
	Object data
)
Visual Basic
Sub Execute ( _
	document As UIDocument, _
	data As Object _
)
Visual C++
void Execute(
	UIDocument^ document,
	Object^ data
)
Parameters
document
Type: Autodesk.Revit.UI.UIDocument
The document on which the data was dropped.
data
Type: System.Object
The data.
See Also
IDropHandler Interface
Autodesk.Revit.UI Namespace